openfoam/case_template_subsonic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000.0;

deltaT          1.0;

writeControl    timeStep;

writeInterval   1;

purgeWrite      2;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

allowSystemOperations 1;

functions
{
    forceCoeffsWing
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        patches         (Wing);
        rho             rhoInf;
        rhoInf          1.225;
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            (0.05 0 0);
        pitchAxis       (0 1 0);
        magUInf         20;
        lRef            0.23;
        Aref            0.171;
    }
    
    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;   
    }

    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        patches         (Wing); 
        writeToFile     true;
        writeControl    timeStep;
        writeInterval   50;
    }

    forcesWing
    {
        type        forces;
        libs        ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        patches     (Wing);          
        p           p;
        U           U;
        rho         rhoInf;           
        rhoInf      1.225;             
        pRef        0;            
        CofR        (0.05 0 0);           // GEOMETRY DEPENDANT - CHANGE ME
        writeFields     yes;
    }
    qCriterion
    {
        type            Q;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   50;
    }
    vorticity
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   50;
    }
}

OptimisationSwitches
{
    fileHandler collated;
}

// ************************************************************************* //
