openfoam/case_template_subsonic/system/snappyHexMeshDict
/*--------------------------------*- C#  -*----------------------------------*\
  =========                 |
  \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    Wing.stl
    {
        type triSurfaceMesh;
        name Wing;
    }
    wakeRegion
    {
        type searchableBox;
        min (0.1 -0.4 -0.075); 
        max (1.1  0.4  0.075);
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    features
    (
        { file "Wing.eMesh"; level 7; }
    );

    refinementSurfaces
    {
        Wing
        {
            level (8 9);
            patchInfo { type wall; }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        wakeRegion
        {
            mode inside;
            levels ((1e15 6)); 
        }
    }

    locationInMesh (0.0 1.0 0.5); // Must be OUTSIDE the wing but INSIDE the blockMesh
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        Wing
        {
            nSurfaceLayers 8;
        }
    }
    expansionRatio 1.2;
    finalLayerThickness 0.5;
    minThickness 0.05;
    nGrow 0;
    featureAngle 80;
    slipFeatureAngle 30;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.05;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

debug 0;
mergeTolerance 1e-6;