openfoam/case_template_subsonic/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    xMin
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }
    xMax
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }
    yMin
    {
        type            zeroGradient;
    }
    yMax
    {
        type            zeroGradient;
    }
    zMin
    {
        type            zeroGradient;
    }
    zMax
    {
        type            zeroGradient;
    }
    Wing
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
