openfoam/case_template_subsonic/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    xMin
    {
        type            freestream;
        freestreamValue $internalField;
    }
    xMax
    {
        type            freestream;
        freestreamValue $internalField;
    }

    yMin
    {
        type            slip;
    }
    yMax
    {
        type            slip;
    }
    zMin
    {
        type            slip;
    }
    zMax
    {
        type            slip;
    }
    Wing
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
