openfoam/case_template_subsonic/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-05;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    
    xMin
    {
        type            calculated;
        value           uniform 0;
    }
    xMax
    {
        type            calculated;
        value           uniform 0;
    }
    yMin
    {
        type            calculated;
        value           uniform 0;
    }
    yMax
    {
        type            calculated;
        value           uniform 0;
    }
    zMin
    {
        type            calculated;
        value           uniform 0;
    }
    zMax
    {
        type            calculated;
        value           uniform 0;
    }
    Wing
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
